# pandas section 5 
## Series

In [1]:
# need to add crash course notes in here. All notes form section 1 to 5 were lost 
# pandas section 5 
# series 

import numpy as np
import pandas as pd

In [3]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [4]:
pd.Series(my_list) # this is a series object. Series is a pandas object.

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(my_list,index=labels) # this will give you the same thing as above using the labels as the index

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr, labels) # this is the same as above but with numpy array

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(d) # this is the same as above but with a dictionary

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [10]:
ser1 = pd.Series([1,2,3,4],index=['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [11]:
ser1['USA']

1

In [12]:
ser2 = pd.Series([1,2,5,4],index=['USA','China','Italy','Japan'])

In [13]:
ser1 + ser2 # this will add the values of the series together. If the index is not the same it will return a NaN

China      NaN
Germany    NaN
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## DataFrames

In [14]:
import numpy as np 
import pandas as pd

In [15]:
from numpy.random import randn

In [16]:
np.random.seed(101) # the seed just makes sure that we get the same random numbers every time we run the code

In [18]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

each column is a pandas series. So W is a series and so are x y and z and they all share a common index. A bunch of series that share an index

In [19]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [20]:
type(df['W']) # proof that this is a series

pandas.core.series.Series

In [21]:
type(df) # proof that this is a dataframe

pandas.core.frame.DataFrame

In [22]:
df.W # can get same result as df['W'] but this is not recommended because it can cause problems if you have a column with the same name as a method. A method is when you do df. then what follows is a method

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [23]:
df[['W','Z']] # this will return a dataframe with the columns W and Z. We needed two brackets because we are passing in a list of columns

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [25]:
# create new column 
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [ ]:
# remove column 
df.drop('new',axis=1) # must specify axis=1 because default is axis=0 which is the index. This will not remove the column from the dataframe. It will just return a new dataframe without the column. To remove the column permanently you must set inplace=True

In [26]:
# notice when we do df again the new column is still there. This is because we did not set inplace=True
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [27]:
df.drop('new', axis=1, inplace=True)

In [28]:
# now you see that the new column is gone 
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652